#define  _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int tmp=0;//临时变量
//	printf("before: a=%d b=%d\n", a, b);
//	//tmp=a;
//	//a = b;
//	//b = tmp;
//
//	//加减法 - 可能会溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	//异或的办法
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("after : a=%d b=%d\n", a, b);
//	return 0;
//}

//编写代码实现：求一个整数存储在内存中的二进制中1的个数。
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);//-1
//
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))
//			count++;
//	}
//	printf("%d\n", count);
//
//	//32bit
//	//num&1 == 1
//	//00000000000000000000000000000011
//	//00000000000000000000000000000001
//	//00000000000000000000000000000000
//	//统计num的补码中有几个1
//	/*while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//	}
//	printf("%d\n", count);*/
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	printf("%d\n", !a);
//	//a = a + 2;
//	//a += 2;//复合赋值符
//	//
//	//a = a >> 1;
//	//a >>= 1;
//
//	//a = a & 1;
//	//a &= 1;
//	return 0;
//}

//sizeof是计算变量所占空间的大小，单位是字节
//printf("%d\n", sizeof a);//是变量可以不加括号，是类型必须加，int[10]这种是数组类型

//int main()
//{
//	int a = 11;
//	a = a | (1 << 2);
//	printf("%d\n", a);//15
//	a = a & (~(1 << 2));
//	printf("%d\n", a);//11
//	//00000000000000000000000000001011
//	//00000000000000000000000000000100
//	//1 << 2;
//	//00000000000000000000000000001111
//	//11111111111111111111111111111011
//	//00000000000000000000000000000100
//	//00000000000000000000000000001011
//
//
//	//int a = 0;
//	//~按（2进制）位取反
//	//00000000000000000000000000000000
//	//11111111111111111111111111111111
//
//	//short s = 0;
//	//int a = 10;
//	//printf("%d\n", sizeof(s = a + 5));//sizeof内部表达式不参与运算
//	//printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;//逻辑与&&只要左边的结果为0，那么右边就不用算了，所以是1234
//	//i = a++||++b||d++;//只要第一个为真，后面就不要算了
//	printf("a = %d\n b = %d\n c = %d\nd = %d\n", a, b, c, d);
//	//程序输出的结果是什么？
//	return 0;
//}